import telebot
from telebot import types

token = "7209840586:AAG428j0DHYX0rvdN4RDGPHrEc3cACc-5vo"
karina = telebot.TeleBot(token)

user_sign = {}

@karina.message_handler(commands=['start'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = types.KeyboardButton("👋 Привітатись")
    btn2 = types.KeyboardButton("🔮 Почати гороскоп")  
    markup.add(btn1, btn2)
    with open('Гороскоп.png.', 'rb') as photo:
        karina.send_photo(message.chat.id, photo, caption="")
        karina.send_message(message.chat.id, text="Привіт, {0.first_name}! Я твій гороскопний помічник✨. Тут ти можеш дізнатись свій гороскоп на сьогодні, а також почати дослідження свого знака зодіаку🌟".format(message.from_user), reply_markup=markup)

@karina.message_handler(content_types=['text'])
def func(message):
    global user_sign
    horoscopes = {
        "Овен ♈️": "Овен, сьогоднішній день принесе багато енергії та нових можливостей! Використовуй шанс для важливих рішень! 💥",
        "Телець ♉️": "Телець, сьогодні ти можеш знайти нові шляхи для досягнення своїх цілей. Залишайся впертий, і все вийде! 🌿",
        "Близнюки ♊️": "Близнюки, сьогодні твоя комунікабельність буде на висоті. Вигравай у розмовах і знайди нових друзів! 💬",
        "Рак ♋️": "Рак, сьогоднішній день принесе спокій і гармонію. Приділи час своєму внутрішньому світу. 🌙",
        "Лев ♌️": "Лев, твоя лідерська сила буде особливо помітна сьогодні. Не бійтеся брати на себе відповідальність! 👑",
        "Діва ♍️": "Діва, сьогодні твоя увага до деталей допоможе досягти великого прогресу. Перевір усе, щоб не було помилок! 🧐",
        "Терези ♎️": "Терези, день принесе гармонію у відносинах. Можливі важливі переговори, на які ти давно чекав. ⚖️",
        "Скорпіон ♏️": "Скорпіон, твоя рішучість сьогодні стане твоєю силою. Всі труднощі будуть переможені, якщо будеш зосереджений. 🔥",
        "Стрілець ♐️": "Стрілець, сьогоднішній день буде сповнений нових ідей і можливостей. Сміливо рухайся вперед! 🏹",
        "Козеріг ♑️": "Козеріг, день принесе успіхи в кар'єрі та роботі. Твоя працьовитість буде винагороджена. 🏆",
        "Водолій ♒️": "Водолій, сьогодні чудовий день для творчості і нових задумів. Не бійтеся експериментувати! 🌊",
        "Риби ♓️": "Риби, сьогоднішній день принесе нові знайомства і можливості для розвитку. Розвивайся, і не бійтеся змін! 🌸"
    }

    if message.text == "👋 Привітатись":
        karina.send_message(message.chat.id, text="Привіт! Скоріше натискай на кнопку 'Почати гороскоп', щоб дізнатись, що чекає на тебе сьогодні! 🌟")
    elif message.text == "🔮 Почати гороскоп":
        markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
        btn1 = types.KeyboardButton("Овен ♈️")
        btn2 = types.KeyboardButton("Телець ♉️")
        btn3 = types.KeyboardButton("Близнюки ♊️")
        btn4 = types.KeyboardButton("Рак ♋️")
        btn5 = types.KeyboardButton("Лев ♌️")
        btn6 = types.KeyboardButton("Діва ♍️")
        btn7 = types.KeyboardButton("Терези ♎️")
        btn8 = types.KeyboardButton("Скорпіон ♏️")
        btn9 = types.KeyboardButton("Стрілець ♐️")
        btn10 = types.KeyboardButton("Козеріг ♑️")
        btn11 = types.KeyboardButton("Водолій ♒️")
        btn12 = types.KeyboardButton("Риби ♓️")
        back = types.KeyboardButton("🔙 Повернутись назад")
        markup.add(btn1, btn2, btn3, btn4, btn5, btn6, btn7, btn8, btn9, btn10, btn11, btn12, back)
        karina.send_message(message.chat.id, text="Обери свій знак зодіаку або постав питання", reply_markup=markup)
    elif message.text in horoscopes:
        user_sign[message.chat.id] = message.text  
        sign = message.text
        karina.send_message(message.chat.id, horoscopes[sign])  

        markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
        btn1 = types.KeyboardButton("Сумісність знаків")
        btn2 = types.KeyboardButton("Щасливі числа")
        btn3 = types.KeyboardButton("Порада дня")
        btn4 = types.KeyboardButton("Дізнатись гороскоп на завтра")
        btn5 = types.KeyboardButton("Повернутись назад")
        markup.add(btn1, btn2, btn3, btn4, btn5)
        karina.send_message(message.chat.id, text="Що хочеш дізнатися ще?", reply_markup=markup)
    
    elif message.text == "Щасливі числа":
        if message.chat.id in user_sign:
            sign = user_sign[message.chat.id]
            lucky_numbers = get_lucky_numbers(sign)
            karina.send_message(message.chat.id, f"Щасливі числа для {sign}: {lucky_numbers}")
        else:
            karina.send_message(message.chat.id, "Будь ласка, спочатку обери свій знак зодіаку.")
    
    elif message.text == "Сумісність знаків":
        if message.chat.id in user_sign:
            sign = user_sign[message.chat.id]
            compatibility = get_compatibility(sign)
            karina.send_message(message.chat.id, f"Сумісність знаків для {sign}: {compatibility}")
        else:
            karina.send_message(message.chat.id, "Будь ласка, спочатку обери свій знак зодіаку.")
    
    elif message.text == "Порада дня":
        if message.chat.id in user_sign:
            sign = user_sign[message.chat.id]
            daily_advice = get_daily_advice(sign)
            karina.send_message(message.chat.id, f"Порада дня для {sign}: {daily_advice}") 
        else:
            karina.send_message(message.chat.id, "Будь ласка, спочатку обери свій знак зодіаку.")

    elif message.text == "Дізнатись гороскоп на завтра":
        if message.chat.id in user_sign:
            sign = user_sign[message.chat.id]
            tomorrow_horoscope = get_tomorrow_horoscope(sign)
            karina.send_message(message.chat.id, f"Порада дня для {sign}: {tomorrow_horoscope}") 
        else:
            karina.send_message(message.chat.id, "Будь ласка, спочатку обери свій знак зодіаку.")

    elif message.text == "🔙 Повернутись назад":
        markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
        btn1 = types.KeyboardButton("👋 Привітатись")
        btn2 = types.KeyboardButton("🔮 Почати гороскоп")  
        markup.add(btn1, btn2)
        karina.send_message(message.chat.id, text="Ви повернулись до головного меню", reply_markup=markup)
    else:
        karina.send_message(message.chat.id, text="Напишіть '/start' щоб повернутись назад")

def get_lucky_numbers(sign):
    lucky_numbers = {
        "Овен ♈️": "3, 7, 9",
        "Телець ♉️": "4, 6, 8",
        "Близнюки ♊️": "5, 10, 12",
        "Рак ♋️": "2, 6, 14",
        "Лев ♌️": "1, 4, 11",
        "Діва ♍️": "5, 7, 13",
        "Терези ♎️": "3, 6, 9",
        "Скорпіон ♏️": "8, 17, 22",
        "Стрілець ♐️": "7, 12, 15",
        "Козеріг ♑️": "4, 8, 16",
        "Водолій ♒️": "11, 18, 21",
        "Риби ♓️": "2, 5, 9"
    }
    return lucky_numbers.get(sign, "Не знайдено щасливих чисел для цього знака")

def get_compatibility(sign):
    compatibility = {
        "Овен ♈️": "Овін та Телець — чудова пара, разом можуть досягти великого!",
        "Телець ♉️": "Телець та Діва — відмінна комбінація для успішного розвитку!",
        "Близнюки ♊️": "Близнюки та Терези — разом вони можуть досягти нових висот!",
        "Рак ♋️": "Рак та Риби — взаєморозуміння на високому рівні!",
        "Лев ♌️": "Лев та Стрілець — сильна та енергійна пара!",
        "Діва ♍️": "Діва та Козеріг — чудова комбінація для досягнення спільних цілей!",
        "Терези ♎️": "Терези та Близнюки — разом можуть долати будь-які труднощі!",
        "Скорпіон ♏️": "Скорпіон та Риби — емоційно багаті та глибокі стосунки!",
        "Стрілець ♐️": "Стрілець та Овен — потужна енергія та оптимізм!",
        "Козеріг ♑️": "Козеріг та Діва — разом досягнуть великих висот!",
        "Водолій ♒️": "Водолій та Близнюки — ідеальний зв'язок для спільного розвитку!",
        "Риби ♓️": "Риби та Скорпіон — глибокі емоції та гармонія!"
    }
    return compatibility.get(sign, "Не знайдено сумісності для цього знака")

def get_daily_advice(sign):
    daily_advice = {
        "Овен ♈️": "Сьогодні найкращий час для того, щоб втілити свої ідеї в життя!",
        "Телець ♉️": "Не бійтеся змін, вони можуть принести вам нові можливості.",
        "Близнюки ♊️": "Вислухайте думки інших людей, це допоможе вам прийняти важливе рішення.",
        "Рак ♋️": "Довіряйте своїй інтуїції, вона не підведе вас.",
        "Лев ♌️": "Будьте відкриті для нових знайомств і можливостей.",
        "Діва ♍️": "Тримайте баланс між роботою та відпочинком, не забувайте про себе.",
        "Терези ♎️": "Розмірковуйте перед тим, як приймати важливі рішення.",
        "Скорпіон ♏️": "Сьогодні може виникнути ситуація, яка вимагатиме від вас рішучості.",
        "Стрілець ♐️": "Залишайтеся оптимістом, навіть якщо ситуація здається складною.",
        "Козеріг ♑️": "Сьогодні варто зайнятися плануванням майбутніх справ, це допоможе уникнути хаосу.",
        "Водолій ♒️": "Не бійтеся йти на компроміси, це допоможе досягти гармонії.",
        "Риби ♓️": "Дайте собі час на відпочинок, щоб відновити сили для нових звершень."
    }
    return daily_advice.get(sign, "Не знайдено поради для цього знака.")

def get_tomorrow_horoscope(sign):
    tomorrow_horoscope = {
        "Овен ♈️": "Завтра на вас чекає день для самовираження та нових досягнень!",
        "Телець ♉️": "Завтра чудовий день для особистих досягнень та розвитку.",
        "Близнюки ♊️": "Завтра буде сприятливий день для ділових зустрічей та переговорів.",
        "Рак ♋️": "Завтра ви зможете досягти гармонії у своїх стосунках.",
        "Лев ♌️": "Завтра важливо зберігати баланс між роботою і відпочинком.",
        "Діва ♍️": "Завтра буде гарний день для розвитку ваших професійних навичок.",
        "Терези ♎️": "Завтра буде день, щоб зосередитися на своїх особистих цілях.",
        "Скорпіон ♏️": "Завтра вас чекає день нових можливостей у кар'єрі.",
        "Стрілець ♐️": "Завтра буде день для важливих рішень у особистих стосунках.",
        "Козеріг ♑️": "Завтра вам буде легко досягти своїх цілей завдяки плануванню.",
        "Водолій ♒️": "Завтра важливо зберігати спокій, щоб уникнути непотрібних конфліктів.",
        "Риби ♓️": "Завтра на вас чекають нові можливості для самовираження та творчості."
    }
    return tomorrow_horoscope.get(sign, "Не знайдено поради для цього знака.")

karina.polling(none_stop=True)
